---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowLegend
source: html/eeaad3da-0b60-b9b0-7092-6c09e041c27b.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.ShowLegend Property

If true, legend is shown in the view.

## Syntax (C#)
```csharp
public bool ShowLegend { get; set; }
```